app/views/sightings/_form.html.erb

SELECT "regions"."name" FROM "regions"
---
  </p>
    <%= form.select(:region, @regions.pluck('name')) %>