app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
    def index
        @animals = Animal.all

INSERT INTO "animals" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Parrot"], ["created_at", "2021-10-14 08:06:21.693861"], ["updated_at", "2021-10-14 08:06:21.693861"]]
---
    def create
        @animal = Animal.new(animal_params)

        if @animal.save

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "regions".* FROM "regions" ORDER BY "regions"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def show
        @animal = Animal.find(params[:id])
        @regions = Region.all

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        @animal = Animal.find(params[:id])

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @animal = Animal.find(params[:id])