app/controllers/regions_controller.rb

SELECT "regions".* FROM "regions"
---
    def index
        @regions = Region.all

INSERT INTO "regions" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2021-10-13 21:28:17.928763"], ["updated_at", "2021-10-13 21:28:17.928763"]]
---
    def create
        @region = Region.new(region_params)

        if @region.save

SELECT "regions".* FROM "regions" WHERE "regions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        @region = Region.find(params[:id])

SELECT "regions".* FROM "regions" WHERE "regions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "regions" SET "name" = ?, "updated_at" = ? WHERE "regions"."id" = ?  [["name", "pakistans"], ["updated_at", "2021-10-13 21:43:35.825186"], ["id", 3]]
---
    def update
        @region = Region.find(params[:id])

        if @region.update(region_params)

SELECT "regions".* FROM "regions" WHERE "regions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "regions" WHERE "regions"."id" = ?  [["id", 3]]
---
    def destroy
        @region = Region.find(params[:id])
        @region.destroy

SELECT "regions".* FROM "regions" WHERE "regions"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def edit
        @region = Region.find(params[:id])