app/controllers/sightings_controller.rb

    def create
        @animal = Animal.find(params[:animal_id])
        @sighting = @animal.sightings.create(sighting_params)
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sightings" ("date", "longitude", "latitude", "animal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "12/03/24"], ["longitude", "123412"], ["latitude", "12341234"], ["animal_id", 1], ["created_at", "2021-10-13 15:09:19.812515"], ["updated_at", "2021-10-13 15:09:19.812515"]]

    def show
        @sighting = Sighting.find(params[:id])
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @sighting = Sighting.find(params[:id])
        @animal = Animal.find(@sighting.animal.id)
        if @sighting.update(sighting_params)
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "sightings" SET "longitude" = ?, "latitude" = ?, "updated_at" = ? WHERE "sightings"."id" = ?  [["longitude", "123"], ["latitude", "123"], ["updated_at", "2021-10-13 15:48:46.821384"], ["id", 1]]

    def destroy
        @animal = Animal.find(params[:animal_id])
        @sighting = @animal.sightings.find(params[:id])
        @sighting.destroy
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "sightings".* FROM "sightings" WHERE "sightings"."animal_id" = ? AND "sightings"."id" = ? LIMIT ?  [["animal_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "sightings" WHERE "sightings"."id" = ?  [["id", 1]]

    def edit
        @sighting = Sighting.find(params[:id])
        @animal = Animal.find(@sighting.animal.id)
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]